Autodesk.Revit.DB.ExternalResourceSubFolder.IconPath
The path of the resource icon.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019.1

Autodesk.Revit.DB.ExternalResourceSubFolder.FolderName
Folder displayed name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019.1

Autodesk.Revit.DB.ExternalResourceSubFolder.#ctor(System.String,System.String)
Constructs a new ExternalResourceSubFolder with custom values for folder name and icon path.
folderName:
Folder displayed name.
iconPath:
The path of the resource icon.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019.1